In [1]:
import os

In [ ]:
!pip uninstall mysql-connector

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\poori\anaconda3\lib\site-packages (8.0.19)
Requirement already satisfied: dnspython==1.16.0 in c:\users\poori\anaconda3\lib\site-packages (from mysql-connector-python) (1.16.0)
Requirement already satisfied: protobuf==3.6.1 in c:\users\poori\anaconda3\lib\site-packages (from mysql-connector-python) (3.6.1)
Requirement already satisfied: six>=1.9 in c:\users\poori\anaconda3\lib\site-packages (from protobuf==3.6.1->mysql-connector-python) (1.11.0)
Requirement already satisfied: setuptools in c:\users\poori\anaconda3\lib\site-packages (from protobuf==3.6.1->mysql-connector-python) (38.4.0)

WARNING: You are using pip version 19.3.1; however, version 20.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [2]:
import mysql.connector

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as lt
import seaborn as sns
%matplotlib inline

In [5]:
import os
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [6]:
#connection=mysql.connector.connect(host='localhost', user="root",password="YYYY",database='imdb',auth_plugin='mysql_native_password')

In [7]:
connection

In [8]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [10]:
pd.read_sql_query("SELECT cast(123 AS DECIMAL(5,2))", connection)

   cast(123 AS DECIMAL(5,2))
0                      123.0

In [12]:
#pd.read_sql_query("SELECT CAST(12345.12 AS NUMERIC(10,5))", connection)

In [13]:
pd.read_sql_query("SELECT cast(123 AS DECIMAL(5,3))", connection)

   cast(123 AS DECIMAL(5,3))
0                     99.999

In [15]:
pd.read_sql_query("SELECT CAST(1234 AS DECIMAL(5,4))", connection)

   CAST(1234 AS DECIMAL(5,4))
0                      9.9999

In [16]:
pd.read_sql_query("SELECT CAST(1234 AS DECIMAL(5,1))", connection)

   CAST(1234 AS DECIMAL(5,1))
0                      1234.0

In [17]:
pd.read_sql_query("SELECT CAST(PI() AS FLOAT)", connection)

   CAST(PI() AS FLOAT)
0             3.141593